local fuckthemtext = {	"我艹懆你.妈.的时候,你还是液体呢",
	"死垃.圾你不觉得你.娘.卖.B.你很丢脸么!",
	"懆你.妈.的千千万，姿势换了①遍又①遍",
	"你.妈生你时是不是把人扔了把胎盘养大",
	"看你现在这么脑S.B残，肯定是以前你后妈天天给你吃毒奶粉造成的",
	"你爸不是黑犬么?怎么你.妈生出了你这个杂交的花犬？",
	"你个怂儿子自己没有本事就不要瞎扯逼,回你.妈洞里再去修炼几年再出来",
	"懆!你!妈!①包瓜子①包糖嘎巴嘎巴懆!你!娘",
	"你他.妈再吊，你也是从你.妈.B里跑出来的!",
	"看你那双手就知道，一定是找不到女朋友，夜夜手.荡引起了弱.智.性.无.能吧！",
	"想必你就是那传说中的一坨屎吧，长得那么猥.琐.丑.恶不用比人介绍都已经一目了然了",
	"你!妈!的B有点丑,你姐的!穴!有!点!肉,你!妹!的!穴!我!搞!不够",
	"你小时候把那眼神清澈得犹如健康的小.便，长大后那眼神浑浊得好似上火的浓痰",
	"你整天吃屎喝尿的,难怪行动缓慢还大小.便.失.禁了",
	"给你一点脸你就不知道自己是个什么东西了？",
	"我看你这个儿子只能默默的拿出宝剑把你俵.子妈劈成八段并且把你俵.子妈.的犬头赠与国足玩",
	"你为什么在这里耀武扬威,你有什么资格？",
	"现在了解什么情况,你完全垃圾似的知道了没？",
	"然后爹地我随便殴打你这样的垃圾似的事实的不是吗。",
	"我就是你父亲似的随便殴打你完全没什么力量似的。",
	"你的脸呢 你.妈给你脸 你装.逼里去了呢？",
	"你好像完完全全不清楚情况一样,你没有发现你 根本不是爹爹的对手吗",
	"爹爹我随随便便 懆你.妈,然后呢 你个犬儿子只有畏畏缩缩的添屎？",
	"你现在是不是坐在电脑前 手心 出汗呢 你是不是紧张了呢",
	"你现在只有乱敲键盘告诉爹地你内心的恐惧呢",
	"爹爹我随随便便弄你 打你个犬狗 儿子  弄死你个鳖孙",
	"你气急败坏的和爹地我絮叨你那不要脸的词了阿？",
	"你不知道自己恨窝囊废阿?",
	"小伙子你八仙过海的赶来狐假虎威的你爹爹我呢?",
	"小伙子是不是妄自尊大啊.窝囊废东西",
	"你.妈死了是不是 我给你.妈杀了 知道不 送你一句 NM$L",
	"老子哔你吗的张三丰和尚太极拳太极剑法大力水手比卡丘数码暴龙肥怪蛇",
	"你tm是什么东西在这里叫 我叫你.妈 干.你.妈",
	"干.你.妈.的血滴子，跟你.妈.的逗比冬瓜皮",
	"干.你.妈.的杀破狼，懆.你.妈.的臭逼",
	"干.你.妈.得海贼王，懆.你.妈.沙僧取和尚九九八十一难",
	"干.你.妈.的超人战士，懆.你.妈.的威猛先生",
	"老子.干.你.妈.的大力水手，香蕉皮，数码宝贝",
	"懆你玛呦，小西天，兄弟，梦幻西游，干.你.妈.的终极皮怪！",
	"懆了你玛的德玛西亚",
	"干.你.妈.的香蕉船",
	"剿你玛的B，老子把你玛的B剿在树上，傻.逼东西",
	"你TM给老子吃屎，懆你玛的臭B，你个土东西！",
	"傻.逼.你.妈.逼是什么弱.智东西  啊？ 你闭嘴好不好！",
	"你个弱.智东西 老子把你.妈干翻 把你.妈干在地上 跪下来添我的包.皮   傻.逼东西",
	"为啥你面对你爹的猛攻毫无还手还嘴之力啊 小 废 物！",
	"刚刚不是很跳的吗小老弟 怎么萎了啊？？？",
		"你爹爹我为什么能这么轻松的把你打成蛤蟆啊？",
	"杀你脏了爹的手 骂你浪费了爹的口水 自己一边吃 屎 去吧",
	"给老子滚去你.妈.的马桶里舔大.便吧",
	"你是刚吃完狗.屎还没够吗？来你这里和你爹狂吠？",
	"你知不知道你这垃.圾.挂跟屎一样？退款买AW吧！",
	"把你.妈.打的屎糊满墙！",
	"就你这垃圾套壳挂还好意思在这里逼逼？",
	"国产随便弄个免费源码套个壳就卖，也就只能骗骗你这种脑瘫低能儿了",
	"当道的时候你这垃.圾.挂的爹妈都还在阴道里翻滚呢",
	"是不是把你小时候你爸鸡.奸.你的心理阴影都打出来了？",
	"好了扫码吧，让爷爷们好好日日你妈.妈.的野逼",
	"别再做狗了，加群买个AW翻身做人吧，让你爸妈在天之灵有个安慰"

};

local last_spam  = globals.TickCount()

local function KillSayChinese()
   
	if globals.TickCount() - last_spam > 64 then
		local response = tostring(fuckthemtext[math.random(1, 59));
		client.ChatSay( ' ' .. response );
		last_spam = globals.TickCount()
	end
end

callbacks.Register( "Draw", KillSayChinese)








--***********************************************--

print("♥♥♥ " .. GetScriptName() .. " loaded without Errors ♥♥♥")

